SCS2211 - LABORATORY II
Practical Sheet - 09

P K M S Thewmika - 22002022

Activity 01

1. Download the dataset
2. Read the dataset to a variable

In [43]:
data <- read.csv("Student Performance new.csv")

3. Change the column names to followings

In [44]:
colnames(data) <- c("id", "race", "edu", "lunch", "prep", "math", "read", "write", "gen")

In [45]:
colnames(data)

[1] "id"    "race"  "edu"   "lunch" "prep"  "math"  "read"  "write" "gen"

4. Change the math, read and write variables to whole number (Multiply by 100)

In [46]:
data$math <- data$math * 100
data$read <- data$read * 100
data$write <- data$write * 100

5. Create a new attribute average (average of math,read and write)

In [47]:
data$average <- rowMeans(data[, c("math", "read", "write")])

6. Find the summary for each mark (math,read and write)

In [48]:
summary(data[c("math", "read", "write")])

      math             read            write
 Min.   :  0.00   Min.   : 17.00   Min.   : 10.00
 1st Qu.: 57.00   1st Qu.: 59.00   1st Qu.: 57.75
 Median : 66.00   Median : 70.00   Median : 69.00
 Mean   : 66.09   Mean   : 69.17   Mean   : 68.05
 3rd Qu.: 77.00   3rd Qu.: 79.00   3rd Qu.: 79.00
 Max.   :100.00   Max.   :100.00   Max.   :100.00

7. Find unique values for attributes
a. race
b. edu
c. lunch
d. prep
e. gen

In [49]:
unique(data$race)
unique(data$edu)
unique(data$lunch)
unique(data$prep)
unique(data$gen)

[1] "group B" "group C" "group A" "group D" "group E"

[1] "bachelor's degree"  "some college"       "master's degree"
[4] "associate's degree" "high school"        "some high school"

[1] "standard"     "free/reduced"

[1] "none"      "completed"

[1] "F" "M"

8. Find average mark for
a. race
b. edu
c. lunch
d. prep
e. gen

In [50]:
aggregate(math ~ race, data, mean)

  race    math
1 group A 61.62921
2 group B 63.45263
3 group C 64.46395
4 group D 67.36260
5 group E 73.82143

In [51]:
aggregate(math ~ edu, data, mean)

  edu                math
1 associate's degree 67.88288
2 bachelor's degree  69.38983
3 high school        62.13776
4 master's degree    69.74576
5 some college       67.12832
6 some high school   63.49721

In [52]:
aggregate(math ~ lunch, data, mean)

  lunch        math
1 free/reduced 58.92113
2 standard     70.03411

In [53]:
aggregate(math ~ prep, data, mean)

  prep      math
1 completed 69.69553
2 none      64.07788

In [54]:
aggregate(math ~ gen, data, mean)

  gen math
1 F   63.63320
2 M   68.72822

Activity 02

1. Download the dataset
2. Read the dataset to a variable

In [55]:
dataset <- read.csv("melb_data.csv")

3. Print first few values of the dataset

In [56]:
head(dataset)

  Suburb     Address          Rooms Type Price   Method SellerG Date
1 Abbotsford 85 Turner St     2     h    1480000 S      Biggin  3/12/2016
2 Abbotsford 25 Bloomburg St  2     h    1035000 S      Biggin  4/02/2016
3 Abbotsford 5 Charles St     3     h    1465000 SP     Biggin  4/03/2017
4 Abbotsford 40 Federation La 3     h     850000 PI     Biggin  4/03/2017
5 Abbotsford 55a Park St      4     h    1600000 VB     Nelson  4/06/2016
6 Abbotsford 129 Charles St   2     h     941000 S      Jellis  7/05/2016
  Distance Postcode ⋯ Bathroom Car Landsize BuildingArea YearBuilt CouncilArea
1 2.5      3067     ⋯ 1        1   202       NA            NA      Yarra
2 2.5      3067     ⋯ 1        0   156       79          1900      Yarra
3 2.5      3067     ⋯ 2        0   134      150          1900      Yarra
4 2.5      3067     ⋯ 2        1    94       NA            NA      Yarra
5 2.5      3067     ⋯ 1        2   120      142          2014      Yarra
6 2.5      3067     ⋯ 1        0   181       NA            NA      Yarra
  Lattitude Longtitude Regionname            Propertycount
1 -37.7996  144.9984   Northern Metropolitan 4019
2 -37.8079  144.9934   Northern Metropolitan 4019
3 -37.8093  144.9944   Northern Metropolitan 4019
4 -37.7969  144.9969   Northern Metropolitan 4019
5 -37.8072  144.9941   Northern Metropolitan 4019
6 -37.8041  144.9953   Northern Metropolitan 4019

4. Find number of missing values in each attribute

In [57]:
missingValues <- colSums(is.na(dataset))
print(missingValues)

       Suburb       Address         Rooms          Type         Price
            0             0             0             0             0
       Method       SellerG          Date      Distance      Postcode
            0             0             0             0             0
     Bedroom2      Bathroom           Car      Landsize  BuildingArea
            0             0            62             0          6450
    YearBuilt   CouncilArea     Lattitude    Longtitude    Regionname
         5375             0             0             0             0
Propertycount
            0

5. Find the mean value for “YearBuilt”

In [58]:
meanYearBuilt <- mean(dataset$YearBuilt, na.rm = TRUE)
print(meanYearBuilt)

[1] 1964.684

Activity 03

1. Create the following dataframe (emp_sal)

In [59]:
emp_sal <- data.frame(
    EmpId <- c(11, 12, 13, 14, 15),
    Dep <- c("Sales", "HR", "Sales", "HR", "Sales"),
    Basic <- c(25450, 22500, 21000, 23500, 15000),
    Allowances <- c(5200, 4500, 3100, 2600, 1800)
)

2. Store net salary in new column named “net_sal”

In [60]:
emp_sal$net_sal <- emp_sal$Basic + emp_sal$Allowances

3. Obtain net salaries of employees attached to sales department

In [61]:
subset(emp_sal, Dep == "Sales", select = "net_sal")

  net_sal
1 30650
3 24100
5 16800

4. Obtain employee IDs of employees whose net salary is above 25000

In [62]:
emp_sal$EmpId [emp_sal$net_sal > 25000]

[1] 11 12 14

5. Obtain employee IDs of employees attached to HR Department whose net salary is
below 25000

In [63]:
emp_sal$EmpId [emp_sal$Dep=="HR" & emp_sal$net_sal < 25000 ]

numeric(0)